SPedt/src/Documents/ВыдачаТранзита/ВыдачаТранзита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаТранзита</name>
  <registerRecords>InformationRegister.СтатусыДоставкиСвернуто</registerRecords>
  <registerRecords>AccumulationRegister.Расход</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.СобранныеЗаказы</registerRecords>
  <registerRecords>InformationRegister.СтатусыЗаявокВТК</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставки</registerRecords>
  <registerRecords>AccumulationRegister.УпакованныеЗаказы</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <registerRecords>AccumulationRegister.КПолучению</registerRecords>
  <registerRecords>AccumulationRegister.ОборотнаяТараДвижение</registerRecords>
  <attributes>
    <name>ТочкаНазначения</name>
    <type>
      <types>CatalogRef.СегментыПунктовВыдачи</types>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаТранзита</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаОтправитель</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоОбмену</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийВыдачаТранзита</types>
    </type>
  </attributes>
  <attributes>
    <name>АктТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрэкНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Супергруппа</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСупергруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСдачиВТК</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеВыдачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибочныеЗаказы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>DefinedType.ТипыЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяХранения</name>
      <comment>в днях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.ФормированиеКоробки</types>
        <types>DocumentRef.УпаковатьЗаказы</types>
        <types>DocumentRef.ОтправлениеТранзита</types>
        <types>DocumentRef.ЗаказыДляТранзита</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.КурьерскаяДоставка</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Предупреждение</name>
      <type>
        <types>EnumRef.ПредупрежденияПрихода</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаНазначения</name>
      <type>
        <types>CatalogRef.СегментыПунктовВыдачи</types>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Упакован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерОтправителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСУчетомСГ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПерваяТочка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздничныхДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъявленнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявкиВТК</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПартииТК</name>
    <attributes>
      <name>НомерПартии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПротоколыПередач</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборотнаяТара</name>
    <attributes>
      <name>Тара</name>
      <type>
        <types>CatalogRef.ОборотнаяТара</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt/src/CommonModules/СтоСПОбмен_ПокупкиВПути/Module.bsl
Функция Получить(ПериодНачала=Неопределено) Экспорт

	ПериодНачала= ПолучитьДатуЗагрузки(ПериодНачала);
	
	ПериодыОтправления 	= ПолучитьПериодыОтправления(ПериодНачала);
	хмл_отправили		= ПолучитьХМЛ(ПериодыОтправления);
	хмл_получили 		= СтоСПОбмен_Общий.Загрузить(хмл_отправили);

	объектXDTO_с_Заказами =  Разбор(хмл_получили);

	тзЗаказов = ПолучитьТаблицуЗаказов(объектXDTO_с_Заказами);
	СтоСПОбмен_Посылки.Загрузить_СоставПосылки_ПоПризнакуДогрузить();
	СтоСПОбмен_Коробки.Загрузить_КоробкиСПризнакомДогрузить();
	
	Результат = СформироватьДокуменыВыдачаТранзитаПоОбмену(тзЗаказов);
	Если Результат.Ошибок = 0 и объектXDTO_с_Заказами <> Ложь Тогда
		СтоСПОбмен_Общий.УстановитьДатуЗагрузки(Справочники.ПараметрыОбмена.ПокупкиВПутиОтчет);
	КонецЕсли;
	Возврат Результат;
КонецФункции	

Функция ПолучитьПериодыОтправления(ПериодНачала)
	текушийПериод = НачалоДня(ПериодНачала);
	периодыОтправления = новый СписокЗначений;
	Пока текушийПериод <= НачалоДня(ТекущаяДата()) Цикл
		периодыОтправления.Добавить(Формат(текушийПериод,"ДФ=dd.MM.yyyy;"));
		текушийПериод = текушийПериод + 60*60*24;
	КонецЦикла;
	Возврат периодыОтправления;	
КонецФункции


Функция ПолучитьДатуЗагрузки(ПериодНачала) 
	Если ПериодНачала=Неопределено Тогда
		ПериодНачала = Справочники.ПараметрыОбмена.ПокупкиВПутиОтчет.ДатаЗагрузки;
	КонецЕсли;
	Если не ЗначениеЗаполнено(ПериодНачала) Тогда
		ПериодНачала= НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	Возврат ПериодНачала;
КонецФункции	

Функция ПолучитьХМЛ(ПериодыОтправления) 
	Тип_transfers				= ФабрикаXDTO.Тип("http://www.100sp.ru/out","distributors.transfers");
	Тип_distributors			= ФабрикаXDTO.Тип("http://www.100sp.ru/out","distributors");
	
	Объект_transfers			 	= ФабрикаXDTO.Создать(Тип_transfers);
	


	Для каждого элем из ПериодыОтправления Цикл	
		Объект_transfers.transfer.Добавить(элем.Значение);
	КонецЦикла;

	Объект_distributors						= ФабрикаXDTO.Создать(Тип_distributors);
	Объект_distributors.transfers			= Объект_transfers;
	
	Возврат СтоСПОбмен_Общий.ПолучитьСтрокуXML(Объект_distributors);
КонецФункции

Функция Разбор(ПолученныеДанные) 
	пространствоИмен		= "http://www.100sp.ru/api/distributor/upload/back/transfer";
	ПолученныеДанные		= СтрЗаменить(ПолученныеДанные,"http://www.100sp.ru",пространствоИмен);
	
	авторизацияВыполнена	= ложь;
	Если ПолученныеДанные 	= "Не удалось соеденится с сайтом" Тогда Возврат авторизацияВыполнена; КонецЕсли;
	
	Тип_distributors		= ФабрикаXDTO.Тип(пространствоИмен, "distributors");
	
	ЧтениеXML 				= Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ПолученныеДанные);
 	Объект_distributors		= ФабрикаXDTO.ПрочитатьXML(ЧтениеXML,Тип_distributors);
	
	Если Объект_distributors.auth.result="ok" Тогда
		авторизацияВыполнена=истина;
	КонецЕсли;
	Если Объект_distributors.transfers = Неопределено Тогда
		Возврат авторизацияВыполнена;
	КонецЕсли;	
	Возврат	Объект_distributors.transfers.transfer;
КонецФункции

Функция ПолучитьТаблицуЗаказов(объектXDTO_с_Заказами)
	тз = новый ТаблицаЗначений;

	ТипЗаказ 		= Новый Массив;
	ТипЗаказ.Добавить(		Тип("СправочникСсылка.Посылки"));
	ТипЗаказ.Добавить(		Тип("СправочникСсылка.Коробки"));
	ТипПунктВыдачи 	= Новый Массив;
	ТипПунктВыдачи.Добавить(Тип("СправочникСсылка.ТочкиРаздачи"));
	КС = Новый КвалификаторыСтроки(12);

	
	тз.Колонки.Добавить("Заказ", 					Новый ОписаниеТипов(ТипЗаказ));
	тз.Колонки.Добавить("ДатаДокумента", 			Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("Группа", 					Новый ОписаниеТипов(ТипЗаказ));
	тз.Колонки.Добавить("ПунктВыдачиОтправитель",	Новый ОписаниеТипов(ТипПунктВыдачи));
	тз.Колонки.Добавить("НомерДокумента",			Новый ОписаниеТипов("Строка",,КС));
	
	
	Для каждого элем из объектXDTO_с_Заказами Цикл
		Для каждого заказ из элем.item Цикл
			новаяСтрока 						= тз.Добавить();
			новаяСтрока.НомерДокумента			= заказ.arrivalNumber;
			новаяСтрока.ДатаДокумента 			= НачалоДня(СтоСПОбмен_Общий.ДатаИзСтроки(заказ.created));
			новаяСтрока.ПунктВыдачиОтправитель 	= СП_РаботаСоСправочниками.ПолучитьПунктВыдачиПо_Коду(заказ.distributorCode);
			Если заказ.orderType = "package" Тогда
				новаяСтрока.Заказ 				= СП_РаботаСоСправочниками.ПолучитьПосылкуПо_Коду(заказ.orderId);				
			КонецЕсли;
			Если ЗначениеЗаполнено(заказ.groupCode)  Тогда
				новаяСтрока.Группа 				= СП_РаботаСоСправочниками.ПолучитьКоробкуПо_Коду(заказ.groupCode);
				СП_РаботаСоСправочниками.ОбновитьКоробку(новаяСтрока.Группа, новый Структура("видСтикера",Перечисления.ВидыСтикеров.ГС) );
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ТаблицаЗаказов = тз.Скопировать(новый Структура("Группа",неопределено));
	
	массНеГрупп = тз.НайтиСтроки(новый Структура("Группа",неопределено));
	Для каждого элем из массНеГрупп Цикл
		тз.Удалить(элем);
	КонецЦикла;
	тз.свернуть("ДатаДокумента, Группа, ПунктВыдачиОтправитель, НомерДокумента");
	
	тз.Колонки.Группа.Имя = "Заказ";
	Для Каждого элем из тз Цикл
		новаяСтрока =ТаблицаЗаказов.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока,элем);
	КонецЦикла;
	
	
	Возврат ТаблицаЗаказов;
Конецфункции


Функция СформироватьДокуменыВыдачаТранзитаПоОбмену(тзЗаказов)
	
	ПолученоЭлементов = 0;
	Ошибок = 0;
	
	ВсеДокументыСформированны = Истина;
	тзКоличество = тзЗаказов.скопировать();
	тзКоличество.свернуть("НомерДокумента, ДатаДокумента, ПунктВыдачиОтправитель");
	ВсегоДокументов = тзКоличество.Количество();
	счетчик		 	= 0;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	вт.НомерДокумента,
		|	вт.ДатаДокумента,
		|	вт.Заказ,
		|	вт.ПунктВыдачиОтправитель
		|ПОМЕСТИТЬ Внешняя
		|ИЗ
		|	&вт КАК вт
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Внешняя.НомерДокумента КАК НомерДокумента,
		|	Внешняя.ДатаДокумента КАК ДатаДокумента,
		|	Внешняя.Заказ,
		|	Внешняя.ПунктВыдачиОтправитель КАК ПунктВыдачиОтправитель
		|ИЗ
		|	Внешняя КАК Внешняя
		|ИТОГИ
		|ПО
		|	ПунктВыдачиОтправитель,
		|	ДатаДокумента";
	
	Запрос.Параметры.Вставить("вт", тзЗаказов);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПунктВыдачиОтправитель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаПунктВыдачиОтправитель.Следующий() Цикл
		ВыборкаПунктВыдачиОтправитель.Количество();
		ВыборкаДатаДокумента = ВыборкаПунктВыдачиОтправитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДатаДокумента.Следующий() Цикл
			Выборка = ВыборкаДатаДокумента.Выбрать();
			//обТранзит = Документы.ВыдачаТранзита.СоздатьДокумент();
			обТранзит = ПолучитьДокументВыдачаТранзита( ВыборкаПунктВыдачиОтправитель.ПунктВыдачиОтправитель, 
														ВыборкаДатаДокумента.ДатаДокумента);

			Пока Выборка.Следующий() Цикл
				строкаЗаказа					= обТранзит.Покупки.Добавить();
				строкаЗаказа.Покупка			= Выборка.Заказ;
				строкаЗаказа.НомерОтправителя	= Выборка.НомерДокумента;
				строкаЗаказа.КоличествоМест		= 1;
				Если ТипЗнч(строкаЗаказа.Покупка) = Тип("СправочникСсылка.Коробки") Тогда
					строкаЗаказа.Количество		= строкаЗаказа.Покупка.Количество;
				иначе
					строкаЗаказа.Количество		= 1;										 
				КонецЕсли;
				Если ТипЗнч(Выборка.Заказ) = Тип("СправочникСсылка.Посылки") Тогда
					строкаЗаказа.Участник		= Выборка.Заказ.Участник;
				КонецЕсли;
			КонецЦикла;

			счетчик 			= счетчик + 1;
			Попытка
				обТранзит.Записать(РежимЗаписиДокумента.Проведение);
					ПолученоЭлементов = ПолученоЭлементов +1;
					ДокументТекст		= "" + ВыборкаПунктВыдачиОтправитель.ПунктВыдачиОтправитель + " "
					+ ВыборкаДатаДокумента.ДатаДокумента;

				ОбщегоНаЗначенияКлиентСервер.СообщитьПользователю("Формирование документов: " + ДокументТекст, , строка(
					счетчик), строка(ВсегоДокументов));

			Исключение
				Ошибок = Ошибок+1;		
				ВсеДокументыСформированны = Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						"При записи документа ""Выдача транзита (по обмежну)"" возникла ошибка :" + ОписаниеОшибки(), ,
					строка(счетчик), строка(ВсегоДокументов));
			КонецПопытки;
		КонецЦикла;

	КонецЦикла;
	Результат = Новый Структура("ПолученоЭлементов,Ошибок",ПолученоЭлементов,Ошибок);
	
 	возврат Результат;
	
КонецФункции


Функция ПолучитьДокументВыдачаТранзита(ТочкаОтправитель, ДатаДок) 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыдачаТранзита.Ссылка
		|ИЗ
		|	Документ.ВыдачаТранзита КАК ВыдачаТранзита
		|ГДЕ
		|	ВыдачаТранзита.ПоОбмену
		|	И ВыдачаТранзита.Дата = &Дата
		|	И ВыдачаТранзита.ТочкаОтправитель = &ТочкаОтправитель
		|	И ВыдачаТранзита.Проведен";
		
		Запрос.УстановитьПараметр("Дата", 				НачалоДня(ДатаДок));
		Запрос.УстановитьПараметр("ТочкаОтправитель", 	ТочкаОтправитель);
		
		Результат 				= Запрос.Выполнить();
		

		ВыборкаДетальныеЗаписи 	= Результат.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
			ВыборкаДетальныеЗаписи.Следующий();
			обТранзит			= ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ИначеЕсли ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
			обТранзит=Документы.ВыдачаТранзита.СоздатьДокумент();
		Иначе	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				обТранзит			= ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				обТранзит.УстановитьПометкуУдаления(Истина);
				обТранзит.Записать();
			КонецЦикла;	
			обТранзит=Документы.ВыдачаТранзита.СоздатьДокумент();
		КонецЕсли;	
		обТранзит.Дата				= НачалоДня(ДатаДок);
		обТранзит.ПоОбмену			= Истина;
		обТранзит.ТочкаНазначения	= Константы.СвояТочка.Получить();
		обТранзит.ТочкаОтправитель	= ТочкаОтправитель;
		обТранзит.ТочкаТранзита		= обТранзит.ТочкаНазначения;
		обТранзит.Покупки.Очистить();		
		
		Возврат обТранзит;
	
	
КонецФункции
